# === Taps ===
tap "atlassian/acli"
tap "cloudflare/cloudflare"
tap "hashicorp/tap"
tap "oven-sh/bun"

# === Core CLI ===
brew "git"
brew "gh"
brew "zsh"

# === Languages / runtimes ===
brew "fnm"                    # Node.js version manager
brew "chruby"                 # Ruby switcher
brew "ruby-install"           # used with chruby
brew "python@3.12"
brew "go"
brew "oven-sh/bun/bun"

# === Databases ===
brew "mysql-client"

# === Infra / cloud ===
brew "cloudflared"
brew "cloudflare/cloudflare/cf-terraforming"
brew "hashicorp/tap/terraform"
brew "opentofu"
brew "atlassian/acli/acli"

# === Document tooling ===
brew "pandoc"
brew "graphviz"
brew "poppler"
brew "weasyprint"

# === Misc ===
brew "speedtest-cli"

# === GUI apps ===
cask "1password"
cask "1password-cli"
cask "visual-studio-code"
cask "dbeaver-community"
cask "gcloud-cli"
